; domain
;; ============================================================
;; D4-V4  Search & Rescue - Heterogeneous Sensing
;; Q1  Basic classical PDDL model  (run with BFWS)
;; ------------------------------------------------------------
;; A team of rescue robots searches a building (graph of rooms).
;; Each robot carries a DIFFERENT subset of sensors:
;;   - thermal : finds a heat signature  -> (detected ?v)
;;   - visual  : confirms it is a victim -> (identified ?v)
;;   - gas     : sweeps a room for hazard -> (gas-checked ?l)
;; No single robot has every sensor, so the robots must
;; cooperate: the right sensor has to be brought to the right
;; room before a victim can be rescued. This is the whole point
;; of the assignment - sensing capability constrains the plan.
;; ============================================================

(define (domain sar-heterogeneous-sensing)

  (:requirements :strips :typing)

  (:types
    robot location victim - object
  )

  (:predicates
    ;; --- world / topology ---
    (at ?r - robot ?l - location)            ; robot position
    (adjacent ?l1 - location ?l2 - location) ; map edge (declare BOTH directions)
    (victim-in ?v - victim ?l - location)    ; ground-truth victim position

    ;; --- sensor capabilities (heterogeneous!) ---
    (has-thermal ?r - robot)
    (has-visual  ?r - robot)
    (has-gas     ?r - robot)

    ;; --- knowledge produced by sensing (the "belief") ---
    (detected   ?v - victim)     ; a heat signature was picked up
    (identified ?v - victim)     ; visually confirmed to be a victim
    (gas-checked ?l - location)  ; room swept and declared safe to enter

    ;; --- goal predicate ---
    (rescued ?v - victim)
  )

  ;; ----- navigation -----
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (at ?r ?from) (adjacent ?from ?to))
    :effect (and (not (at ?r ?from)) (at ?r ?to))
  )

  ;; ----- thermal sensing: produces a "detection" -----
  (:action thermal-scan
    :parameters (?r - robot ?v - victim ?l - location)
    :precondition (and (at ?r ?l) (has-thermal ?r) (victim-in ?v ?l))
    :effect (and (detected ?v))
  )

  ;; ----- visual sensing: upgrades a detection to an identification -----
  (:action visual-identify
    :parameters (?r - robot ?v - victim ?l - location)
    :precondition (and (at ?r ?l) (has-visual ?r) (victim-in ?v ?l) (detected ?v))
    :effect (and (identified ?v))
  )

  ;; ----- gas sensing: clears the room for entry -----
  (:action gas-sweep
    :parameters (?r - robot ?l - location)
    :precondition (and (at ?r ?l) (has-gas ?r))
    :effect (and (gas-checked ?l))
  )

  ;; ----- rescue: any robot can extract, but only AFTER the full
  ;;       heterogeneous sensing chain has been completed -----
  (:action rescue
    :parameters (?r - robot ?v - victim ?l - location)
    :precondition (and (at ?r ?l)
                       (victim-in ?v ?l)
                       (identified ?v)
                       (gas-checked ?l))
    :effect (and (rescued ?v))
  )
)

; problem
;; ============================================================
;; Q1 - PROBLEM B : "sensor-specific reasoning is required"
;; Three SPECIALISED robots - no robot owns more than one sensor:
;;   thermalbot : thermal only
;;   visualbot  : visual  only
;;   gasbot     : gas     only
;; Two victims in two different rooms. To rescue EITHER victim,
;; all three specialised robots must converge on that room (in the
;; right causal order). The planner is forced to reason about
;; WHICH robot must go WHERE - the heterogeneous-sensing core of
;; the assignment. Cooperation is mandatory; no single robot can
;; complete the chain alone.
;; ============================================================

(define (problem sar-heterogeneous)
  (:domain sar-heterogeneous-sensing)

  (:objects
    thermalbot visualbot gasbot       - robot
    entrance hallway roomA roomB      - location
    v1 v2                             - victim
  )

  (:init
    ;; all robots start at the entrance
    (at thermalbot entrance)
    (at visualbot  entrance)
    (at gasbot     entrance)

    ;; map:  entrance - hallway - roomA
    ;;                         \- roomB
    (adjacent entrance hallway) (adjacent hallway entrance)
    (adjacent hallway roomA)    (adjacent roomA hallway)
    (adjacent hallway roomB)    (adjacent roomB hallway)

    ;; victims
    (victim-in v1 roomA)
    (victim-in v2 roomB)

    ;; HETEROGENEOUS sensors - one each, no overlap
    (has-thermal thermalbot)
    (has-visual  visualbot)
    (has-gas     gasbot)
  )

  (:goal (and (rescued v1) (rescued v2)))
)

; plan
1. (move thermalbot entrance hallway)
   deleted: (at thermalbot entrance)
   added: (at thermalbot hallway)
   goals met: 0 of 2
2. (move thermalbot hallway roomb)
   deleted: (at thermalbot hallway)
   added: (at thermalbot roomb)
   goals met: 0 of 2
3. (thermal-scan thermalbot v2 roomb)
   added: (detected v2)
   goals met: 0 of 2
4. (move visualbot entrance hallway)
   deleted: (at visualbot entrance)
   added: (at visualbot hallway)
   goals met: 0 of 2
5. (move gasbot entrance hallway)
   deleted: (at gasbot entrance)
   added: (at gasbot hallway)
   goals met: 0 of 2
6. (move visualbot hallway roomb)
   deleted: (at visualbot hallway)
   added: (at visualbot roomb)
   goals met: 0 of 2
7. (visual-identify visualbot v2 roomb)
   added: (identified v2)
   goals met: 0 of 2
8. (move gasbot hallway roomb)
   deleted: (at gasbot hallway)
   added: (at gasbot roomb)
   goals met: 0 of 2
9. (gas-sweep gasbot roomb)
   added: (gas-checked roomb)
   goals met: 0 of 2
10. (rescue gasbot v2 roomb)
   added: (rescued v2)
   goals met: 1 of 2
11. (move thermalbot roomb hallway)
   deleted: (at thermalbot roomb)
   added: (at thermalbot hallway)
   goals met: 1 of 2
12. (move thermalbot hallway rooma)
   deleted: (at thermalbot hallway)
   added: (at thermalbot rooma)
   goals met: 1 of 2
13. (thermal-scan thermalbot v1 rooma)
   added: (detected v1)
   goals met: 1 of 2
14. (move visualbot roomb hallway)
   deleted: (at visualbot roomb)
   added: (at visualbot hallway)
   goals met: 1 of 2
15. (move gasbot roomb hallway)
   deleted: (at gasbot roomb)
   added: (at gasbot hallway)
   goals met: 1 of 2
16. (move gasbot hallway rooma)
   deleted: (at gasbot hallway)
   added: (at gasbot rooma)
   goals met: 1 of 2
17. (gas-sweep gasbot rooma)
   added: (gas-checked rooma)
   goals met: 1 of 2
18. (move visualbot hallway rooma)
   deleted: (at visualbot hallway)
   added: (at visualbot rooma)
   goals met: 1 of 2
19. (visual-identify visualbot v1 rooma)
   added: (identified v1)
   goals met: 1 of 2
20. (rescue gasbot v1 rooma)
   added: (rescued v1)
   goals met: 2 of 2
